const PHOTOS_COUNT = 25;

const COMMENTS_ARRAY_LENGTH = {
  min: 1,
  max: 30,
};

const COMMENTS_LIST = ['Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!',
];

const NAMES_LIST = [
  'Иван',
  'Дмитрий',
  'Ксения',
  'Виктор',
  'Екатерина',
  'Анастасия',
  'Антон',
];

const DESCRIPTION_LIST = [
  'описание 1',
  'описание 2',
  'описание 3',
  'описание 4',
  'описание 5',
  'описание 6',
  'описание 7',
  'описание 8',
  'описание 9',
];

export {PHOTOS_COUNT, COMMENTS_ARRAY_LENGTH, NAMES_LIST, DESCRIPTION_LIST, COMMENTS_LIST};
